Revit 2027 API
PerformanceAdviser.ExecuteRules Method
Overload List
Name | Description
ExecuteRules(Document, IList<PerformanceAdviserRuleId>) |  Executes selected rules on a given document.
ExecuteRules(Document, IList<Int32>) |  Executes selected rules on a given document.
Top
See Also
Reference
PerformanceAdviser Class
Autodesk.Revit.DB Namespace